about.org
#+title: About me

* 哲学
** 思维
- 逻辑和理性思维是一切的基石，吹牛逼除外
- 知识体系要么结构化，要么丢掉
  
** 信条
- 学习是从宏观到微观；实践相反
- 信息必追管溯源，二手信息必定偏颇且错误
- 英文是当今世界的元语言

* 爱好
双子座天性使然，爱好广泛，如果一段时间深入一个领域，自行立马超过大部分人

** 运动
- 跑步，间歇性坚持选手
- 徒步，爬山，路在脚下，哪里都是风景
- 骑行，走路太慢了

** 工具
- Emacs 和第二大脑理论拥护者

** 语言
- Python 一度深入研究
- C 语言曾经的大学班级（院系）权威，51 单片机飞起

** 其他
- 电子元器件焊接大师级 
- Excel 准大师级
- LFS
- Gentoo
- Arch Linux
- GNU Guix

* 装备
** 硬件
- HHKB 键盘，低调极简性冷淡风的键盘适合长时间文字输入

** 软件
- Emacs
- 私有 K3s 集群
  
* 工作
- 开发运维工程师
- 运维工程师
- 电子维修工程师

* 关于网站
这个网站主要用来展示平时写的中文博客文章，没有特别的主题定位，只求有一点意义。

** 技术
- Org-mode，用于写文章
- Org-publish，配置好用于将 =.org= 格式转化成 =.html= 格式，并自动生成 =sitemap= 等其他页面
- Cloudflare Pages 托管静态网站

* 个人链接
- https://github.com/meifatang
