public_html/about.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2022-04-24 Sun 11:28 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>关于</title>
<meta name="author" content="Felix M. Tang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./style.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<header>
  <nav>
    <a href="./index.html">Home</a>
    <a href="./theindex.html">Articles</a>
    <a href="./about.html">About</a>
  </nav>
</header>
</div>
<div id="content" class="content">
<h1 class="title">关于</h1>

<div id="outline-container-orgd4d9d6c" class="outline-2">
<h2 id="orgd4d9d6c"><span class="section-number-2">1.</span> 哲学</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgf6e7192" class="outline-3">
<h3 id="orgf6e7192"><span class="section-number-3">1.1.</span> 思维</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>逻辑和理性思维是一切的基石，吹牛逼除外</li>
<li>知识体系要么结构化，要么丢掉</li>
</ul>
</div>
</div>

<div id="outline-container-org811e43b" class="outline-3">
<h3 id="org811e43b"><span class="section-number-3">1.2.</span> 信条</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>学习是从宏观到微观；实践相反</li>
<li>信息必追管溯源，二手信息必定偏颇且错误</li>
<li>英文是当今世界的元语言</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc036ab8" class="outline-2">
<h2 id="orgc036ab8"><span class="section-number-2">2.</span> 爱好</h2>
<div class="outline-text-2" id="text-2">
<p>
双子座天性使然，爱好广泛，如果一段时间深入一个领域，自行立马超过大部分人
</p>
</div>

<div id="outline-container-org870df5f" class="outline-3">
<h3 id="org870df5f"><span class="section-number-3">2.1.</span> 运动</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>跑步，间歇性坚持选手</li>
<li>徒步，爬山，路在脚下，哪里都是风景</li>
<li>骑行，走路太慢了</li>
</ul>
</div>
</div>

<div id="outline-container-org0ed2bea" class="outline-3">
<h3 id="org0ed2bea"><span class="section-number-3">2.2.</span> 工具</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Emacs 和第二大脑理论拥护者</li>
</ul>
</div>
</div>

<div id="outline-container-orgcb4ef7c" class="outline-3">
<h3 id="orgcb4ef7c"><span class="section-number-3">2.3.</span> 语言</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>Python 一度深入研究</li>
<li>C 语言曾经的大学班级（院系）权威，51 单片机飞起</li>
</ul>
</div>
</div>

<div id="outline-container-org9dbf444" class="outline-3">
<h3 id="org9dbf444"><span class="section-number-3">2.4.</span> 其他</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li>电子元器件焊接大师级</li>
<li>Excel 准大师级</li>
<li>LFS</li>
<li>Gentoo</li>
<li>Arch Linux</li>
<li>GNU Guix</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orge2bfc43" class="outline-2">
<h2 id="orge2bfc43"><span class="section-number-2">3.</span> 装备</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org6dc67a8" class="outline-3">
<h3 id="org6dc67a8"><span class="section-number-3">3.1.</span> 硬件</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>HHKB 键盘，低调极简性冷淡风的键盘适合长时间文字输入</li>
</ul>
</div>
</div>

<div id="outline-container-org21e6dcf" class="outline-3">
<h3 id="org21e6dcf"><span class="section-number-3">3.2.</span> 软件</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Emacs</li>
<li>私有 K3s 集群</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org890c537" class="outline-2">
<h2 id="org890c537"><span class="section-number-2">4.</span> 工作</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>开发运维工程师</li>
<li>运维工程师</li>
<li>电子维修工程师</li>
</ul>
</div>
</div>

<div id="outline-container-org7b563c1" class="outline-2">
<h2 id="org7b563c1"><span class="section-number-2">5.</span> 关于网站</h2>
<div class="outline-text-2" id="text-5">
<p>
这个网站主要用来展示平时写的中文博客文章，没有特别的主题定位，只求有一点意义。
</p>
</div>

<div id="outline-container-orgea57f5c" class="outline-3">
<h3 id="orgea57f5c"><span class="section-number-3">5.1.</span> 技术</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>Org-mode，用于写文章</li>
<li>Org-publish，配置好用于将 <code>.org</code> 格式转化成 <code>.html</code> 格式，并自动生成 <code>sitemap</code> 等其他页面</li>
<li>Cloudflare Pages 托管静态网站</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb2b566b" class="outline-2">
<h2 id="orgb2b566b"><span class="section-number-2">6.</span> 个人链接</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="https://github.com/meifatang">https://github.com/meifatang</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <div class="copyright-container">
    <div class="copyright">
      版权所有 &copy; 2022 汤美法
    </div>
  </div>
  <div class="generated">
    使用 <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.50 (<a href="https://orgmode.org">Org</a> mode 9.5.2) 构建</a>
  </div>
</footer>
</div>
</body>
</html>
